In [34]:
import pandas as pd

In [35]:
peaple = {"first_name" :['3bdo' , 'ahmed' , 'asmaa'],
        "last_name" :['ragab' , 'ali' , 'kamal'],
        "e-mail" :['3bdo@ragab' , 'ahmed@ali' , 'asmaa@sayed']
         }

In [36]:
df = pd.DataFrame(peaple)
df

  first_name last_name       e-mail
0       3bdo     ragab   3bdo@ragab
1      ahmed       ali    ahmed@ali
2      asmaa     kamal  asmaa@sayed

In [37]:
filt = df['first_name'] == 'asmaa'
df[filt]

  first_name last_name       e-mail
2      asmaa     kamal  asmaa@sayed

In [38]:
df.columns

Index(['first_name', 'last_name', 'e-mail'], dtype='object')

In [39]:
df.columns = ['first' , 'last' , 'email']

In [40]:
df

   first   last        email
0   3bdo  ragab   3bdo@ragab
1  ahmed    ali    ahmed@ali
2  asmaa  kamal  asmaa@sayed

In [41]:
df.rename(columns={'first' : 'first_name',
                    'last' : 'last_name'})

  first_name last_name        email
0       3bdo     ragab   3bdo@ragab
1      ahmed       ali    ahmed@ali
2      asmaa     kamal  asmaa@sayed

In [42]:
df

   first   last        email
0   3bdo  ragab   3bdo@ragab
1  ahmed    ali    ahmed@ali
2  asmaa  kamal  asmaa@sayed

In [43]:
df.rename(columns={'first' : 'first_name',
                    'last' : 'last_name'} , inplace=True)

In [44]:
df

  first_name last_name        email
0       3bdo     ragab   3bdo@ragab
1      ahmed       ali    ahmed@ali
2      asmaa     kamal  asmaa@sayed

In [45]:
df

  first_name last_name        email
0       3bdo     ragab   3bdo@ragab
1      ahmed       ali    ahmed@ali
2      asmaa     kamal  asmaa@sayed

In [46]:
df.columns = ['first' , 'last' , 'email']

In [47]:
df

   first   last        email
0   3bdo  ragab   3bdo@ragab
1  ahmed    ali    ahmed@ali
2  asmaa  kamal  asmaa@sayed

In [48]:
df.loc[1] = ['yosef' , 'nabil' , 'y@kamel']

In [49]:
df

   first   last        email
0   3bdo  ragab   3bdo@ragab
1  yosef  nabil      y@kamel
2  asmaa  kamal  asmaa@sayed

In [50]:
df.loc[1,'email'] = 'ooooo'

In [51]:
df

   first   last        email
0   3bdo  ragab   3bdo@ragab
1  yosef  nabil        ooooo
2  asmaa  kamal  asmaa@sayed

In [52]:
df.loc[1,['first','email']] = ['osama' , 'o@oooo']

In [53]:
df

   first   last        email
0   3bdo  ragab   3bdo@ragab
1  osama  nabil       o@oooo
2  asmaa  kamal  asmaa@sayed

In [57]:
filt = df['first'] == 'asmaa'
df.loc[filt , 'last'] = 'mostafa'

In [58]:
df

   first     last        email
0   3bdo    ragab   3bdo@ragab
1  osama    nabil       o@oooo
2  asmaa  mostafa  asmaa@sayed

In [60]:
df['last'].replace({'ragab' : 'ramy',
                     'nabil' : 0})

0       ramy
1          0
2    mostafa
Name: last, dtype: object

In [61]:
df['last'].map({'ragab' : 'mohsen' ,
                 'nabil' : 0})

0    mohsen
1         0
2       NaN
Name: last, dtype: object